app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id]) # present a certain article
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @article = Article.new # process of making a new article
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-12-01 20:11:03.741814"], ["updated_at", "2019-12-01 20:11:03.741814"]]

  def edit
    @article = Article.find(params[:id]) # finding a existing article
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @article = Article.find(params[:id])  # find the id
    @article.update(title: params[:article][:title], description: params[:article][:description]) # update the attributes of the article
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-12-01 20:13:50.742177"], ["id", 1]]